src/InformationRegisters/ПолученныеДанныеИБ/ПолученныеДанныеИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПолученныеДанныеИБ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ХешСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТелоЗапроса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПингиИнформационныхБаз/ПингиИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПингиИнформационныхБаз</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыОбработкиЗапросовНаАкцепт/СтатусыОбработкиЗапросовНаАкцепт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОбработкиЗапросовНаАкцепт</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>Принят</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВариантыРазмещенияИнформационныхБаз/ВариантыРазмещенияИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыРазмещенияИнформационныхБаз</name>
  <enumValues>
    <name>Файловый</name>
  </enumValues>
  <enumValues>
    <name>КлиентСерверный</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ТипыСерверов/ТипыСерверов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСерверов</name>
  <enumValues>
    <name>Кластер1С</name>
  </enumValues>
  <enumValues>
    <name>СУБД</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ЗапросыНаАкцептИБ/ЗапросыНаАкцептИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗапросыНаАкцептИБ</name>
  <attributes>
    <name>ИдентификаторИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаСоединения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелоЗапроса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбработки</name>
    <type>
      <types>EnumRef.СтатусыОбработкиЗапросовНаАкцепт</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринялРешение</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </attributes>
</mdclass:Document>

src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <attributes>
    <name>ИдентификаторИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонфигурации</name>
    <type>
      <types>CatalogRef.ВидыКонфигураций</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>CatalogRef.ВерсииКонфигураций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРазмещения</name>
    <type>
      <types>EnumRef.ВариантыРазмещенияИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПоддержки</name>
    <type>
      <types>EnumRef.СтатусыПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИБ</name>
    <type>
      <types>EnumRef.СтатусыИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКаталогИБ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверИБ</name>
    <type>
      <types>CatalogRef.Серверы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСУБД</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверСУБД</name>
    <type>
      <types>CatalogRef.Серверы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияТехнологическойПлатформы</name>
    <type>
      <types>CatalogRef.ВерсииТехнологическойПлатформы</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонУведомленияПодключение</name>
    <type>
      <types>CatalogRef.ШаблоныСообщений</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/РаботаСJSON/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ОбработатьСообщениеОт1С(ТекстJSON, Результат) Экспорт
	
	ДанныеJSON = РазобратьJSONВСтруктуру(ТекстJSON);
	Если Не ПроверитьСообщениеОт1С(ДанныеJSON) Тогда
		Возврат;
	КонецЕсли;
	
	ТипКоманды = ВРег(ДанныеJSON.команда.тип);
	ИдентификаторИБ = ДанныеJSON.информационнаяБаза.идентификаторИБ;	
	Период = ПолучитьПериодИзКоманды(ДанныеJSON.команда);
	
	НачатьТранзакцию();
	
	Попытка
		
		Если ТипКоманды = "ПИНГ" Тогда
			ОбработатьПинг(ИдентификаторИБ, Период, Результат);
		ИначеЕсли ТипКоманды = "АКЦЕПТ" Тогда
			ОбработатьАкцепт(ДанныеJSON, ИдентификаторИБ, Период, ТекстJSON, Результат);
		ИначеЕсли ТипКоманды = "ДАННЫЕ" Тогда
			ОбработатДанные(ДанныеJSON, ИдентификаторИБ, Период, ТекстJSON, Результат);
		Иначе
			ВызватьИсключение "Неизвестный тип команды: " + ТипКоманды;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ИнфоОбОшибке = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Ошибка обработки JSON", УровеньЖурналаРегистрации.Ошибка,,, ИнфоОбОшибке);
		Результат.Вставить("Акцепт", Ложь);
		Результат.Вставить("Комментарий", ИнфоОбОшибке);
		
	КонецПопытки;
	
КонецПроцедуры

Функция РазобратьJSONВСтруктуру(ТекстJSON) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстJSON);
	Попытка
		ДанныеJSON = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Ошибка парсинга JSON", УровеньЖурналаРегистрации.Ошибка,,, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	ЧтениеJSON.Закрыть();
	
	Возврат ДанныеJSON;
	
КонецФункции 

Функция ПроверитьСообщениеОт1С(ДанныеJSON) Экспорт
	
	Если Не ДанныеJSON.Свойство("команда") Тогда
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Некорректный JSON: отсутствует поле 'команда'", УровеньЖурналаРегистрации.Предупреждение);
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ДанныеJSON.команда.Свойство("тип") Тогда
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Некорректный JSON: отсутствует поле 'команда.тип'", УровеньЖурналаРегистрации.Предупреждение);
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ДанныеJSON.команда.Свойство("времяОтправки") Тогда
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Некорректный JSON: отсутствует поле 'команда.времяОтправки'", УровеньЖурналаРегистрации.Предупреждение);
		Возврат Ложь;
	КонецЕсли;
	
	Если ДанныеJSON.команда.тип <> "пинг" Тогда
		
		Если Не ДанныеJSON.Свойство("информационнаяБаза") Тогда
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Некорректный JSON: отсутствует блок 'информационнаяБаза'", УровеньЖурналаРегистрации.Предупреждение);
			Возврат Ложь;
		КонецЕсли;
		
		Если Не (ДанныеJSON.информационнаяБаза.Свойство("идентификаторИБ")
			И ДанныеJSON.информационнаяБаза.Свойство("строкаСоединения") 
			И ДанныеJSON.информационнаяБаза.Свойство("версияТехнологическойПлатформы")
			И ДанныеJSON.информационнаяБаза.Свойство("конфигурация") 
			И ДанныеJSON.информационнаяБаза.Свойство("подсистемы")
			И ДанныеJSON.информационнаяБаза.Свойство("расширения")) Тогда
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Некорректный JSON: отсутствуют ключевые поля в 'информационнаяБаза'", УровеньЖурналаРегистрации.Предупреждение);
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;

	Возврат Истина;
	
КонецФункции

Функция ЗаписатьДанныеИнформационнойБазы(ДанныеИБ, СсылкаИБ, Период, ТекстJSON, ЭтоСоздание) Экспорт
	
	// Вычисление хеш-суммы
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	ЗаписатьJSON(ЗаписьJSON, ДанныеИБ);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеширование.Добавить(СтрокаJSON);
	ХешСумма = НРег(ПолучитьHexСтрокуИзДвоичныхДанных(Хеширование.ХешСумма));
	
	// Проверка необходимости обновления
	Если Не ЭтоСоздание Тогда
		Если Не НужноОбновитьДанные(СсылкаИБ, ХешСумма) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	// Создание или обновление объекта ИБ
	Если ЭтоСоздание Тогда
		ИБОбъект = Справочники.ИнформационныеБазы.СоздатьЭлемент();
		ИБОбъект.УстановитьСсылкуНового(СсылкаИБ);
		ИБОбъект.ИдентификаторИБ = ДанныеИБ.идентификаторИБ;
	Иначе
		ИБОбъект = СсылкаИБ.ПолучитьОбъект();
	КонецЕсли;
	
	ИБОбъект.ДополнительныеСвойства.Вставить("СсылкаИБ", СсылкаИБ);
	ИБОбъект.ДополнительныеСвойства.Вставить("Период", Период);
	
	СтруктураЗаполнения = ПодготовитьСтруктуруЗаполнения(ДанныеИБ);
	ИБОбъект.Заполнить(СтруктураЗаполнения);
	ИБОбъект.Записать();
	
	// Запись в регистр ПолученныеДанныеИБ
	МенеджерЗаписи = РегистрыСведений.ПолученныеДанныеИБ.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = Период;
	МенеджерЗаписи.ИнформационнаяБаза = СсылкаИБ;
	МенеджерЗаписи.ХешСумма = ХешСумма;
	МенеджерЗаписи.ТелоЗапроса = Новый ХранилищеЗначения(ТекстJSON);
	МенеджерЗаписи.Записать(Истина);
	
	Возврат Истина;
	
КонецФункции

Функция ФорматироватьСтроку(СтрокаJSON, ПереносСтрокJSON = Неопределено, СимволыОтступа = " ", ИспользоватьДвойныеКавычки = Истина, ЭкранированиеСимволов = Неопределено) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	Структура = ПрочитатьJSON(ЧтениеJSON, Ложь);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON, СимволыОтступа, ИспользоватьДвойныеКавычки, ЭкранированиеСимволов);
	ЗаписьJSON.УстановитьСтроку(ПараметрыJSON);
	
	ЗаписатьJSON(ЗаписьJSON, Структура);
	
	СтрокаJSON = ЗаписьJSON.Закрыть();

	Возврат СтрокаJSON;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьПинг(ИдентификаторИБ, Период, Результат)

	СсылкаИБ = ИнформационныеБазы.НайтиЭлементПоИдентификатору(ИдентификаторИБ);
	Если СсылкаИБ.Пустая() Тогда
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Пинг от неизвестной информационной базы.",
			УровеньЖурналаРегистрации.Ошибка,,, "Идентификатор: " + ИдентификаторИБ);
		
		Результат.Вставить("Акцепт", Ложь);
		Результат.Вставить("Комментарий", "Пинг от неизвестной информационной базы для системы контроля релизов.");
		
		Возврат;
		
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ПингиИнформационныхБаз.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = Период;
	МенеджерЗаписи.ИнформационнаяБаза = СсылкаИБ;
	МенеджерЗаписи.Записать(Истина);
	
	Результат.Вставить("Акцепт", Истина);
	Результат.Вставить("Комментарий", "Пинг принят.");
	
КонецПроцедуры

Процедура ОбработатьАкцепт(ДанныеJSON, ИдентификаторИБ, Период, ТекстJSON, Результат)
	
	СсылкаИБ = ИнформационныеБазы.НайтиЭлементПоИдентификатору(ИдентификаторИБ);
	Если Не СсылкаИБ.Пустая() Тогда
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Повторный запрос на акцепт для уже существующей ИБ.",
			УровеньЖурналаРегистрации.Предупреждение, , , "Идентификатор: " + ИдентификаторИБ);
		
		Результат.Вставить("Акцепт", Истина);
		Результат.Вставить("Комментарий", "Повторный запрос на акцепт для уже существующей ИБ.");
		
		Возврат;
		
	КонецЕсли;
	
	РезультатАкцептования = РезультатАкцептования(ИдентификаторИБ);
	
	СтатусОбработки = РезультатАкцептования.СтатусОбработки;
	ДокументАкцепта = РезультатАкцептования.ДокументАкцепта;
	
	Если СтатусОбработки = Перечисления.СтатусыОбработкиЗапросовНаАкцепт.Принят Тогда
		
		// По сути исключительная ветка, т.к. если база найдена в системе, то выйдем из процедуры выше по коду
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Запрос от акцептованной ИБ.",
			УровеньЖурналаРегистрации.Информация,,, "Идентификатор: " + ИдентификаторИБ);
		
		Результат.Вставить("Акцепт", Истина);
		Результат.Вставить("Комментарий",
			СтрШаблон("ИБ с идентификатором %1 акцептована. Документ в системе контроля релизов - %2", ИдентификаторИБ, ДокументАкцепта));
		
	ИначеЕсли СтатусОбработки = Перечисления.СтатусыОбработкиЗапросовНаАкцепт.Отклонен Тогда
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Запрос от ИБ, акцепт по которой отклонён.",
			УровеньЖурналаРегистрации.Информация,,, "Идентификатор: " + ИдентификаторИБ);
		
		Результат.Вставить("Акцепт", Ложь);
		Результат.Вставить("Комментарий",
			СтрШаблон("Акцепт для ИБ с идентификатором %1 отклонён. Документ в системе контроля релизов - %2", ИдентификаторИБ, ДокументАкцепта));
		
	ИначеЕсли СтатусОбработки = Перечисления.СтатусыОбработкиЗапросовНаАкцепт.Новый Тогда 
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Запрос от ИБ, ожидающей акцепта.",
			УровеньЖурналаРегистрации.Информация,,, "Идентификатор: " + ИдентификаторИБ);
		
		Результат.Вставить("Акцепт", Ложь);
		Результат.Вставить("Комментарий",
			СтрШаблон("ИБ с идентификатором %1 ожидает акцепта. Документ в системе контроля релизов - %2", ИдентификаторИБ, ДокументАкцепта));
		
	Иначе
		
		// В противном случае создадим документ акцептования
		ДокументОбъект = Документы.ЗапросыНаАкцептИБ.СоздатьДокумент();
		ДокументОбъект.Дата = Период;
		ДокументОбъект.ИдентификаторИБ = ИдентификаторИБ;
		ДокументОбъект.СтрокаСоединения = ДанныеJSON.информационнаяБаза.строкаСоединения;
		ДокументОбъект.ТелоЗапроса = Новый ХранилищеЗначения(ТекстJSON);
		ДокументОбъект.ВремяПолучения = Период;
		ДокументОбъект.СтатусОбработки = Перечисления.СтатусыОбработкиЗапросовНаАкцепт.Новый;
		ДокументОбъект.ИнформационнаяБаза = Справочники.ИнформационныеБазы.ПустаяСсылка();
		
		Попытка
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			Результат.Вставить("Акцепт", Ложь);
			Результат.Вставить("Комментарий", СтрШаблон("Создан запрос на акцепт ИБ - %1. Документ акцепта - %2", ИдентификаторИБ, ДокументОбъект.Ссылка));
			
		Исключение
			
			ИнфоОбОшибке = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Ошибка обработки акцепта", УровеньЖурналаРегистрации.Ошибка,,, ИнфоОбОшибке);
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатДанные(ДанныеJSON, ИдентификаторИБ, Период, ТекстJSON, Результат)
	
	СсылкаИБ = ИнформационныеБазы.НайтиЭлементПоИдентификатору(ИдентификаторИБ);
	Если СсылкаИБ.Пустая() Тогда
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Обновление неизвестной информационной базы.",
			УровеньЖурналаРегистрации.Ошибка, , , "Идентификатор: " + ИдентификаторИБ);
		
		Результат.Вставить("Акцепт", Ложь);
		Результат.Вставить("Комментарий", "Попытка обновления неизвестной информационной базы для системы контроля релизов.");
		
		Возврат;
		
	КонецЕсли;
	
	ИнформационныеБазы.УстановитьБлокировку(ИдентификаторИБ, СсылкаИБ);
	
	ДанныеИБ = ДанныеJSON.информационнаяБаза;
	Обновлены = ЗаписатьДанныеИнформационнойБазы(ДанныеИБ, СсылкаИБ, Период, ТекстJSON, Ложь);
	Если Обновлены Тогда
		
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Данные информационной базы успешно обновлены.",
			УровеньЖурналаРегистрации.Информация,,, "Идентификатор: " + ИдентификаторИБ);
			
		Результат.Вставить("Акцепт", Истина);
		Результат.Вставить("Комментарий", "Данные информационной базы в системе контроля релизов успешно обновлены.");
		
	Иначе
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Данные информационной базы не изменились.",
			УровеньЖурналаРегистрации.Информация,,, "Идентификатор: " + ИдентификаторИБ);
			
		Результат.Вставить("Акцепт", Истина);
		Результат.Вставить("Комментарий", "Данные информационной базы в системе контроля релизов актуальны.");
		
	КонецЕсли;
	
КонецПроцедуры

Функция НужноОбновитьДанные(СсылкаИБ, НоваяХешСумма)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПолученныеДанныеИБ.ХешСумма КАК ХешСумма
		|ИЗ
		|	РегистрСведений.ПолученныеДанныеИБ КАК ПолученныеДанныеИБ
		|ГДЕ
		|	ПолученныеДанныеИБ.ИнформационнаяБаза = &ИнформационнаяБаза
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПолученныеДанныеИБ.Период УБЫВ";
	Запрос.УстановитьПараметр("ИнформационнаяБаза", СсылкаИБ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.ХешСумма = НоваяХешСумма Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПодготовитьСтруктуруЗаполнения(ДанныеИБ) Экспорт
	
	Структура = Новый Структура;
	
	Структура.Вставить("СтрокаСоединения", ДанныеИБ.строкаСоединения);
	
	ВариантРазмещения = ОбщегоНазначенияКР.ВариантРазмещенияПоСтрокеСоединения(Структура.СтрокаСоединения);
	Структура.Вставить("ВариантРазмещения", ВариантРазмещения);
	
	Если ВариантРазмещения = Перечисления.ВариантыРазмещенияИнформационныхБаз.КлиентСерверный Тогда
		Срвр = ОбщегоНазначенияКР.ИзвлечьПараметрИзСтрокиСоединения(Структура.СтрокаСоединения, "Srvr");
		Имя = ОбщегоНазначенияКР.ИзвлечьПараметрИзСтрокиСоединения(Структура.СтрокаСоединения, "Ref");
		Структура.Вставить("ИмяКаталогИБ", Имя);
		Структура.Вставить("СерверИБ", Серверы.ПолучитьЭлемент(Срвр, Перечисления.ТипыСерверов.Кластер1С));
	ИначеЕсли ВариантРазмещения = Перечисления.ВариантыРазмещенияИнформационныхБаз.Файловый Тогда
		Каталог = ОбщегоНазначенияКР.ИзвлечьПараметрИзСтрокиСоединения(Структура.СтрокаСоединения, "File");
		Структура.Вставить("ИмяКаталогИБ", Каталог);
		Структура.Вставить("СерверИБ", Справочники.Серверы.ПустаяСсылка());
	Иначе
		Структура.Вставить("ИмяКаталогИБ", "");
		Структура.Вставить("СерверИБ", Справочники.Серверы.ПустаяСсылка());
	КонецЕсли;
	
	ВерсияПлатформы = ДанныеИБ.версияТехнологическойПлатформы;
	Структура.Вставить("ВерсияТехнологическойПлатформы", ВерсииТехнологическойПлатформы.ПолучитьЭлемент(ВерсияПлатформы));
	
	Конфигурация = ДанныеИБ.конфигурация;
	ВидКонфигурации = ВидыКонфигураций.ПолучитьЭлемент(Конфигурация.имя, Конфигурация.синоним);
	Структура.Вставить("ВидКонфигурации", ВидКонфигурации);
	Структура.Вставить("Версия", ВерсииКонфигураций.ПолучитьЭлемент(ВидКонфигурации, Конфигурация.версия));
	
	// Подсистемы
	МассивПодсистем = Новый Массив;
	Для Каждого ПодсистемаJSON Из ДанныеИБ.подсистемы Цикл
		ПодсистемаСсылка = ПодсистемыКонф.ПолучитьЭлемент(ПодсистемаJSON.имя);
		ВерсияСсылка = ВерсииПодсистемКонф.ПолучитьЭлемент(ПодсистемаСсылка, ПодсистемаJSON.версия);
		МассивПодсистем.Добавить(Новый Структура("Подсистема, Версия", ПодсистемаСсылка, ВерсияСсылка));
	КонецЦикла;
	Структура.Вставить("Подсистемы", МассивПодсистем);
	
	// Расширения
	МассивРасширений = Новый Массив;
	Для Каждого РасширениеJSON Из ДанныеИБ.расширения Цикл
		РасширениеСсылка = РасширенияКонф.ПолучитьЭлемент(РасширениеJSON.имя, РасширениеJSON.синоним);
		ВерсияСсылка = ВерсииРасширенийКонф.ПолучитьЭлемент(РасширениеСсылка, РасширениеJSON.версия, РасширениеJSON.хешСумма);
		Назначение = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Перечисление.НазначенияРасширений." + РасширениеJSON.назначение);
		МассивРасширений.Добавить(Новый Структура(
			"РасширениеКонфигурации, Версия, ХешСумма, Активно, Назначение, БезопасныйРежим",
			РасширениеСсылка, ВерсияСсылка, РасширениеJSON.хешСумма, РасширениеJSON.активно, Назначение, РасширениеJSON.безопасныйРежим));
	КонецЦикла;
	Структура.Вставить("Расширения", МассивРасширений);
	
	Возврат Структура;
	
КонецФункции

Функция ПолучитьПериодИзКоманды(ДанныеJSON)
	
	Попытка
		Возврат XMLЗначение(Тип("Дата"), ДанныеJSON.времяОтправки);
	Исключение
		Возврат ТекущаяДатаСеанса();
	КонецПопытки;
	
КонецФункции

Функция РезультатАкцептования(ИдентификаторИБ)
	
	СтруктураВозврата = Новый Структура("ДокументАкцепта,СтатусОбработки");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗапросыНаАкцептИБ.Ссылка) КАК ДокументАкцепта,
	|	ЗапросыНаАкцептИБ.СтатусОбработки КАК СтатусОбработки
	|ИЗ
	|	Документ.ЗапросыНаАкцептИБ КАК ЗапросыНаАкцептИБ
	|ГДЕ
	|	ЗапросыНаАкцептИБ.Проведен
	|	И ЗапросыНаАкцептИБ.ИдентификаторИБ = &ИдентификаторИБ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗапросыНаАкцептИБ.Дата УБЫВ,
	|	ЗапросыНаАкцептИБ.Номер УБЫВ";
	
	Запрос.УстановитьПараметр("ИдентификаторИБ", ИдентификаторИБ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти
